app/controllers/api/v1/users_controller.rb

  def create
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "auth_token") VALUES (?, ?, ?, ?, ?)

  def update
    user = User.find(params[:id])

    if user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "newmail@example.com"], ["updated_at", "2016-03-27 19:32:09.775825"], ["id", 1]]

  def destroy
    user = User.find(params[:id])
    user.destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]